{
    "title": "Minu Koduserveri Seadistus",
    "description": "Keskkond tehnoloogiaga katsetamiseks, teenuste majutamiseks ja pidevaks enesetäiendamiseks.",
    "personalProject": "Isiklik Projekt",
    "intro1": "Kuigi pilveteenused pakuvad mugavust ja usaldusväärsust, olen loonud isikliku koduserveri keskkonna, et katsetada tehnoloogiaid, majutada oma teenuseid ja säilitada täielik kontroll oma andmete üle. See projekt ühendab minu tehnoloogiakire praktilise õppega viisil, mida kommertskeskkonnad sageli ei võimalda.",
    "intro2": "Aja jooksul on minu koduserver arenenud ühest masinast mitme sõlmega kõrge saadavusega klasteriks, mis toetab erinevaid isiklikke ja professionaalseid teenuseid. See on pidev õppimiskogemus, mis täiendab minu professionaalset tarkvaraarendust praktilise infrastruktuuri alase teadmisega.",
    "infrastructure": "Infrastruktuur",
    "coreComponents": "Põhikomponendid",
    "infrastructureDescription": "Minu koduserver põhineb usaldusväärsel riistvaral, virtualiseerimisel ja võrgutehnoloogiatel, mis koos loovad paindliku ja võimsa keskkonna.",
    "proxmoxCluster": "Proxmox Klaster",
    "proxmoxDesc": "Kolme sõlmega kõrge käideldavusega Proxmox VE klaster teenuste sujuvaks migreerimiseks ja maksimaalseks tööajaks",
    "proxmoxDetail1": "Kolm kohandatud ehitatud serverisõlme Intel protsessoritega ja salvestuse liiasusega",
    "proxmoxDetail2": "Peamine 'lily' sõlm 32-tuumalise i9-13900K protsessoriga, 32GB RAM, 1TB SSD virtuaalmasinatele ja 250GB SSD operatsioonisüsteemile",
    "proxmoxDetail3": "Teisene 'zara1' sõlm 12-tuumalise Xeon E-2236 protsessoriga, 32GB ECC RAM, 1TB SSD virtuaalmasinatele, 120GB OS SSD, ja 2x 1TB kõvakettad ZFS peegelduses varundamiseks",
    "proxmoxDetail4": "Kolmas 'zara2' sõlm 4-tuumalise Intel Pentium Gold protsessoriga, 8GB RAM, 1TB SSD, ja 2x 1TB kõvakettad ZFS peegelduses varunduse replitseerimiseks",
    "proxmoxDetail5": "Reaalajas migratsiooni võimalused nullseisakuga hoolduseks",
    "virtualizedDesktop": "Virtualiseeritud Töölaud",
    "virtualizedDesktopDesc": "Täielik töölaua virtualiseerimine GPU ja USB läbipääsuga peaaegu puhtale riistvarale lähedase jõudlusega",
    "virtualizedDesktopDetail1": "Windows VM pühendatud GPU läbipääsuga graafikamahukatele rakendustele",
    "virtualizedDesktopDetail2": "Täielik USB-seadmete läbipääs välisseadmetele",
    "virtualizedDesktopDetail3": "VM-i hetktõmmise võimalused süsteemi varundamiseks ja kiireks taastamiseks",
    "virtualizedDesktopDetail4": "Sujuv jõudlus, mis pole peaaegu eristamatu puhtast riistvarast",
    "virtualizedDesktopDetail5": "Lihtne migratsioon füüsiliste hostide vahel hoolduse paindlikkuseks",
    "network": "Võrgu Infrastruktuur",
    "networkDesc": "Virtualiseeritud võrgundus OPNsense'iga, mis pakub täiustatud marsruutimise ja turvaomadusi",
    "networkDetail1": "Virtualiseeritud OPNsense ruuter täieliku võrgu isolatsiooniga",
    "networkDetail2": "VLAN segmenteerimine teenuste vahel turvalisuse eraldamiseks",
    "networkDetail3": "Sisemine DNS-server kohalike teenuste avastamiseks",
    "networkDetail4": "Liikluse jälgimine ja teenuse kvaliteedi (QoS) rakendamine",
    "networkDetail5": "VPN server turvalise kaugjuurdepääsu jaoks koduvõrku",
    "backup": "Varundussüsteem",
    "backupDesc": "Mitmetasandiline varunduse strateegia kohaliku ja pilve liiasusega",
    "backupDetail1": "Kohalikud ZFS peegeldatud kettad mõlemal varundusel andmete liiasuseks",
    "backupDetail2": "Ristsõlme replikatsioon kaitseks sõlmetõrgete eest",
    "backupDetail3": "Proxmox Varundusserver VM-ide ja konteinerite varunduseks",
    "backupDetail4": "Tunni tagant toimuvad välised varundused Blackblaze pilvesalvestusse",
    "backupDetail5": "Kohandatud varunduse skriptid andmebaasi väljavõteteks ja konfiguratsioonifailideks",
    "galleryTitle": "Koduserveri Riistvara ja Ekraanipildid",
    "galleryDescription": "Visuaalne ülevaade minu kolme sõlmega Proxmox klastrist ja ise majutatud teenustest",
    "infrastructureScreenshots": "Infrastruktuuri Ekraanipildid",
    "applications": "Rakendused",
    "selfHostedServices": "Ise Majutatud Teenused",
    "selfHostedServicesDescription": "Infrastruktuur toetab mitmesuguseid teenuseid, mis pakuvad alternatiive pilvepõhistele valikutele, andes mulle täieliku kontrolli oma andmete ja seadistuste üle.",
    "emailServer": "E-posti Server (Mailcow)",
    "emailServerDesc": "Täielik e-posti lahendus rämpspostifiltri, DKIM, SPF, DMARC ja veebiliidesega",
    "photoManagement": "Fotohaldus (Immich)",
    "photoManagementDesc": "Ise majutatud Google Photos alternatiiv isiklikele meediakogudele AI-funktsioonidega",
    "gitServer": "Git Server (Gitea)",
    "gitServerDesc": "Kerge Git server isiklikuks ja professionaalseks projektide versioonihalduseks",
    "fileSharing": "Failide Jagamine (Samba)",
    "fileSharingDesc": "Isiklik pilvesalvestus ja failide jagamise lahendus, mis on juurdepääsetav kõigil seadmetel",
    "documentation": "Dokumentatsioon (Bookstack)",
    "documentationDesc": "Teadmusbaas tehnilise dokumentatsiooni ja juhendite jaoks",
    "devEnvironments": "Arenduskeskkonnad",
    "devEnvironmentsDesc": "Isoleeritud arendus- ja testimiskeskkonnad tarkvaraprojektide jaoks",
    "motivation": "Motivatsioon",
    "whyMaintainHomelab": "Miks Ma Hoian Koduserveri Keskkonda",
    "motivationParagraph1": "Koduserveri keskkonna hoidmine ei ole vajadusest või kuluefektiivsusest tingitud – see on kirg tehnoloogia vastu ja pidev eneseareng. Komponentide uurimine, serverite ehitamine, virtualiseerimise seadistamine ja teenuste juurutamine pakuvad väärtuslikku praktilist kogemust, mis täiendab minu professionaalset tööd.",
    "motivationParagraph2": "Kuigi pilveteenuseid oleks lihtsam kasutada, hindan ma täielikku kontrolli oma andmete üle ja sügavat arusaama infrastruktuurist, mis tuleb kõike ise üles ehitades. See on minu tehniline mänguväljak, kus saan katsetada uusi tehnoloogiaid, konfiguratsioone ja seadistusi viisidel, mis poleks tootmiskeskkonnas võimalikud.",
    "motivationParagraph3": "See projekt on oluliselt laiendanud minu arusaama süsteemiarhitektuurist ja infrastruktuurist viisil, mis avaldub otseselt minu töös tarkvaraarendajana. Lähedane teadmine sellest, kuidas alusüsteemid toimivad, aitab mul luua tõhusamat ja töökindlamat tarkvara.",
    "skillsDeveloped": "Arendatud Oskused:",
    "learningOutcome1": "Sügav arusaam virtualiseerimise tehnoloogiatest ja nende piirangutest",
    "learningOutcome2": "Praktiline kogemus kõrge käideldavusega konfiguratsioonide ja tõrkesiirdega",
    "learningOutcome3": "Edasijõudnud võrgunduse teadmised, sealhulgas VLAN-id, marsruutimine ja liikluse haldamine",
    "learningOutcome4": "Süsteemiadministreerimise oskused, mida saab rakendada nii isiklikes kui ka ettevõtte keskkondades",
    "learningOutcome5": "Riistvara valik ja optimeerimine spetsiifiliste töökoormuste jaoks",
    "learningOutcome6": "Keerukate omavahel seotud süsteemide veaotsimine",
    "learningOutcome7": "Andmehaldus, varundusstrateegiad ja katastroofi taastamise planeerimine",
    "node": "Sõlm",
    "storage": "Salvestus",
    "role": "Roll",
    "viewDetails": "Vaata üksikasju",
    "close": "Sulge",
    "previous": "Eelmine",
    "next": "Järgmine",
    "screenshotAlt1": "Proxmox VE töölaud - VM-ide ja konteinerite ülevaade",
    "screenshotDesc1": "Proxmox virtuaalkeskkonna peamine töölaud, mis näitab kolme sõlmega klastrit kõigi virtuaalmasinate ja konteineritega. Klaster sisaldab mitmesuguseid LXC konteinereid (kergete teenuste jaoks) ja täielikke VM-e nõudlikumate rakenduste jaoks.",
    "screenshotAlt2": "Kohandatud varundus skripti käivitamine",
    "screenshotDesc2": "Kohandatud varundus skript töötamas Blackblaze agendi konteineris. See skript teostab oluliste andmete tunni tagant väliseid varundusi Blackblaze pilvesalvestusse, kindlustades kriitilise info väliselt. Skript varundab erinevaid teenuseid, sealhulgas Mailcow (e-post), Immich (fotod), Gitea (git), Bookstack (dokumentatsioon) ja Samba (failide jagamine).",
    "screenshotAlt3": "Peamine sõlm 'lily' ressursikasutus",
    "screenshotDesc3": "Ressursikasutus peamisel 'lily' sõlmel Intel i9-13900K protsessoriga. See sõlm haldab kõige nõudlikumaid töökoormusi 32 CPU tuuma ja 32GB RAM-iga, näidates tõhusat ressursside jaotust praeguse koormuse juures.",
    "screenshotAlt4": "Teisene sõlm 'zara1' ressursikasutus",
    "screenshotDesc4": "Ressursside jälgimine 'zara1' sõlmes, mida käitab Xeon E-2236 CPU. See sõlm toimib nii arvutusserverina kui ka peamise varundusserverina oma ZFS peegeldatud ketastega ning on töötanud üle 31 päeva ilma katkestusteta, demonstreerides seadistuse stabiilsust.",
    "screenshotAlt5": "Kolmas sõlm 'zara2' ressursikasutus",
    "screenshotDesc5": "Ressursside jälgimine 'zara2' sõlmes, mis toimib täiendava arvutusvõimsusena ja teisese varundussüsteemina klastri jaoks. Selle ZFS peegel tagab, et varundusandmed on liiaselt salvestatud, pakkudes veel üht andmekaitseringi.",
    "screenshotAlt6": "Proxmox Backup Server liides",
    "screenshotDesc6": "Proxmox Backup Server liides, mis näitab sünkroniseerimisjärgse sõlmede vahel. See tagab, et andmed on replitseeritud mitme füüsilise masina vahel liiasuse ja katastroofi taastamise jaoks, koos täiendavate väliste varundustega Blackblaze pilve."
  }