{
    "title": "My Homelab Setup",
    "description": "A personal playground for technology exploration, self-hosting, and continuous learning",
    "personalProject": "Personal Project",
    "intro1": "While cloud services offer convenience and reliability, I maintain a personal homelab environment to experiment with technologies, host my own services, and maintain complete control over my data. This project combines my passion for technology with practical learning in a way that commercial environments often can't accommodate.",
    "intro2": "My homelab has evolved over time from a single server to a multi-node high-availability cluster supporting various personal and professional services. It's a continuous learning experience that complements my professional software development work with hands-on infrastructure knowledge.",
    "infrastructure": "Infrastructure",
    "coreComponents": "Core Components",
    "infrastructureDescription": "My homelab is built on a foundation of reliable hardware, virtualization, and networking technologies that work together to create a flexible, powerful environment.",
    "proxmoxCluster": "Proxmox Cluster",
    "proxmoxDesc": "Three-node high-availability Proxmox VE cluster for seamless service migration and maximum uptime",
    "proxmoxDetail1": "Three custom-built server nodes with Intel processors and storage redundancy",
    "proxmoxDetail2": "Primary 'lily' node with 32-core i9-13900K, 32GB RAM, 1TB SSD for VMs and 250GB SSD for OS",
    "proxmoxDetail3": "Secondary 'zara1' node with 12-core Xeon E-2236, 32GB ECC RAM, 1TB SSD for VMs, 120GB OS SSD, and 2x 1TB HDDs in ZFS mirror for backup",
    "proxmoxDetail4": "Tertiary 'zara2' node with 4-core Intel Pentium Gold, 8GB RAM, 1TB SSD, and 2x 1TB HDDs in ZFS mirror for backup replication",
    "proxmoxDetail5": "Live migration capabilities for zero-downtime maintenance",
    "virtualizedDesktop": "Virtualized Desktop",
    "virtualizedDesktopDesc": "Full desktop virtualization with GPU and USB passthrough for near-bare-metal performance",
    "virtualizedDesktopDetail1": "Windows VM with dedicated GPU passthrough for graphics-intensive applications",
    "virtualizedDesktopDetail2": "Complete USB device passthrough for peripherals",
    "virtualizedDesktopDetail3": "VM snapshot capabilities for system backup and rapid restoration",
    "virtualizedDesktopDetail4": "Seamless performance nearly indistinguishable from bare metal",
    "virtualizedDesktopDetail5": "Easy migration between physical hosts for maintenance flexibility",
    "network": "Network Infrastructure",
    "networkDesc": "Virtualized networking with OPNsense providing advanced routing and security features",
    "networkDetail1": "Virtualized OPNsense router with full network isolation",
    "networkDetail2": "VLAN segmentation for security separation between services",
    "networkDetail3": "Internal DNS server for local service discovery",
    "networkDetail4": "Traffic monitoring and quality of service (QoS) implementation",
    "networkDetail5": "VPN server for secure remote access to home network",
    "backup": "Backup System",
    "backupDesc": "Multi-layered backup strategy with local and cloud redundancy",
    "backupDetail1": "Local ZFS mirrored drives on both backup nodes for data redundancy",
    "backupDetail2": "Cross-node replication for protection against node failures",
    "backupDetail3": "Proxmox Backup Server for VM and container backups",
    "backupDetail4": "Hourly offsite backups to Blackblaze cloud storage",
    "backupDetail5": "Custom backup scripts for database dumps and configuration files",
    "galleryTitle": "Homelab Hardware & Screenshots",
    "galleryDescription": "Visual tour of my three-node Proxmox cluster and self-hosted services",
    "infrastructureScreenshots": "Infrastructure Screenshots",
    "applications": "Applications",
    "selfHostedServices": "Self-Hosted Services",
    "selfHostedServicesDescription": "The infrastructure supports a variety of services that provide alternatives to cloud-based options, giving me complete control over my data and configurations.",
    "emailServer": "Email Server (Mailcow)",
    "emailServerDesc": "Complete email solution with spam filtering, DKIM, SPF, DMARC, and web interface",
    "photoManagement": "Photo Management (Immich)",
    "photoManagementDesc": "Self-hosted Google Photos alternative for personal media collections with AI features",
    "gitServer": "Git Server (Gitea)",
    "gitServerDesc": "Lightweight Git server for personal and professional project version control",
    "fileSharing": "File Sharing (Samba)",
    "fileSharingDesc": "Personal cloud storage and file sharing solution accessible across all devices",
    "documentation": "Documentation (Bookstack)",
    "documentationDesc": "Knowledge base for technical documentation and guides",
    "devEnvironments": "Development Environments",
    "devEnvironmentsDesc": "Isolated development and testing environments for software projects",
    "motivation": "Motivation",
    "whyMaintainHomelab": "Why I Maintain a Homelab",
    "motivationParagraph1": "Maintaining this homelab setup isn't about necessity or cost efficiency—it's about passion for technology and continuous learning. The process of researching components, building servers, configuring virtualization, and implementing services provides hands-on experience that complements my professional work.",
    "motivationParagraph2": "While it would be easier to use cloud services, I value the complete control over my data and the deep understanding of infrastructure that comes from building everything myself. It's a technical playground where I can experiment with new technologies, configurations, and setups in ways that wouldn't be possible in a production environment.",
    "motivationParagraph3": "This project has enhanced my understanding of system architecture and infrastructure in ways that directly translate to my work as a software developer. Having intimate knowledge of how the underlying systems work helps me build more efficient, reliable software.",
    "skillsDeveloped": "Skills Developed:",
    "learningOutcome1": "Deep understanding of virtualization technologies and their limitations",
    "learningOutcome2": "Practical experience with high-availability configurations and failover mechanisms",
    "learningOutcome3": "Advanced networking knowledge including VLANs, routing, and traffic management",
    "learningOutcome4": "System administration skills applicable to both personal and enterprise environments",
    "learningOutcome5": "Hardware selection and optimization for specific workloads",
    "learningOutcome6": "Troubleshooting complex interconnected systems",
    "learningOutcome7": "Data management, backup strategies, and disaster recovery planning",
    "node": "Node",
    "storage": "Storage",
    "role": "Role",
    "viewDetails": "View details",
    "close": "Close",
    "previous": "Previous",
    "next": "Next",
    "screenshotAlt1": "Proxmox VE Dashboard - VM and Container Overview",
    "screenshotDesc1": "Main Proxmox Virtual Environment dashboard showing the three-node cluster with all virtual machines and containers. The cluster includes a variety of LXC containers (for lightweight services) and full VMs for more demanding applications.",
    "screenshotAlt2": "Custom Backup Script Execution",
    "screenshotDesc2": "A custom backup script running on the Blackblaze agent container. This script performs hourly offline backups of important data to Blackblaze cloud storage, securing critical information offsite. The script backs up various services including Mailcow (email), Immich (photos), Gitea (git), Bookstack (documentation), and Samba (file sharing).",
    "screenshotAlt3": "Primary Node 'lily' Resource Utilization",
    "screenshotDesc3": "Resource utilization on the primary 'lily' node with an Intel i9-13900K processor. This node handles the most demanding workloads with 32 CPU cores and 32GB of RAM, showing efficient resource allocation with the current load.",
    "screenshotAlt4": "Secondary Node 'zara1' Resource Utilization",
    "screenshotDesc4": "Resource monitoring for the 'zara1' node powered by a Xeon E-2236 CPU. This node serves as both a compute server and the primary backup server with its ZFS mirrored drives, and has been running for over 31 days without interruption, demonstrating the stability of the setup.",
    "screenshotAlt5": "Tertiary Node 'zara2' Resource Utilization",
    "screenshotDesc5": "Resource monitoring for the 'zara2' node, which serves as additional compute capacity and a secondary backup system for the cluster. Its ZFS mirror ensures that backup data is redundantly stored, providing another layer of data protection.",
    "screenshotAlt6": "Proxmox Backup Server Interface",
    "screenshotDesc6": "Proxmox Backup Server interface showing the synchronization jobs between nodes. This ensures data is replicated across multiple physical machines for redundancy and disaster recovery, with additional offsite backups to Blackblaze cloud."
  }